# Makefileの書き方
# 設定の仕方	[変数名] = [定義]
# 慣例として変数名全て大文字で書く



################   Makefileの中で用いる変数	################
# 実行ファイル名
TARGET = main

# 生成したい静的ファイル名
NAME = hoge.a

# コンパイル対象としたいプログラム
# 1行に収まらない場合\を使って複数行に書くことができる
SRCS = sqliteFunc.c main.c

# 生成したいオブジェクトファイル名
# SRCSで定義されている/cファイルから.oを生成する
OBJS = $(SRCS:.c=.o)

# コンパイラの指定
CC	= gcc

# コンパイルオプションの指定
CFLAGS = -Wall

# インクルードファイルのパス指定
INC	= -I../inc 

# ライブラリファイルのパス指定
LIBS	= -lsqlite3 -lncurses

################	makeコマンドを設定	################
# <コマンド名>:	
#				<呼び出されるルール>
# <コマンド名>: <必要なファイル>
#				 <呼び出されるルール>
# <コマンド名>: 
#				<呼び指すコマンド名>

all: $(TARGET)

$(TARGET): $(OBJS)
	$(CC) $(OBJS) -o $(TARGET) $(LIBS)

%.o: %.c
	$(CC) -c $<

clean:
	rm -f $(OBJS) $(TARGET)